app/controllers/passwords_controller.rb

  def index
    @passwords = Password.all
---
SELECT "passwords".* FROM "passwords"

  def create
    @password = Password.new(password_params)

    respond_to do |format|
      if @password.save
---
INSERT INTO "passwords" ("characters", "strong", "created_at", "updated_at", "name") VALUES ('Pa55word!', NULL, '2026-02-24 16:17:56.787227', '2026-02-24 16:17:56.787227', NULL) RETURNING "id"

  def update
    respond_to do |format|
      if @password.update(password_params)
---
UPDATE "passwords" SET "characters" = 'gt27kj!gdf78L', "updated_at" = '2026-02-02 10:23:59.492020' WHERE "passwords"."id" = 2

  def destroy
    @password.destroy!
---
DELETE FROM "passwords" WHERE "passwords"."id" = 5

    def set_password
      @password = Password.find(params.expect(:id))
---
SELECT "passwords".* FROM "passwords" WHERE "passwords"."id" = 1 LIMIT 1